In [70]:
# For data maipulation 
import numpy as np
import pandas as pd

# For data visualization 
import seaborn as sns 
import matplotlib as mpl
import matplotlib.pyplot as plt
from matplotlib.ticker import PercentFormatter

In [71]:
# Importing primary data
primary_data = pd.read_csv('summer_olympics.csv')

In [72]:
# Importing supportive data
regions = pd.read_csv('noc_regions.csv')

In [73]:
#Importing supportive data
gdp = pd.read_csv('gdp_data.csv')

In [7]:
#Importing supportive data
happiness = pd.read_csv('2017_happiness.csv')

In [74]:

#Importing supportive data
host = pd.read_csv('olym_host.csv')

In [75]:
#Importing supportive data
#This file is 15 MB, so might take some time to get loaded inside kernel

athlete_data = pd.read_csv(athlete_events.csv')

SyntaxError: EOL while scanning string literal (<ipython-input-75-0c557e48125a>, line 4)

In [13]:
#Kindly Wait for below function to show output
athlete_data.head(10)

,Name,Sex,NOC,Year,Season,Sport,Event,Medal
0,A Dijiang,M,CHN,1992,Summer,Basketball,Basketball Men's Basketball,NaN
1,A Lamusi,M,CHN,2012,Summer,Judo,Judo Men's Extra-Lightweight,NaN
2,Gunnar Nielsen Aaby,M,DEN,1920,Summer,Football,Football Men's Football,NaN
3,Edgar Lindenau Aabye,M,DEN,1900,Summer,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,Christine Jacoba Aaftink,F,NED,1988,Winter,Speed Skating,Speed Skating Women's 500 metres,NaN
5,Christine Jacoba Aaftink,F,NED,1988,Winter,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
6,Christine Jacoba Aaftink,F,NED,1992,Winter,Speed Skating,Speed Skating Women's 500 metres,NaN
7,Christine Jacoba Aaftink,F,NED,1992,Winter,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
8,Christine Jacoba Aaftink,F,NED,1994,Winter,Speed Skating,Speed Skating Women's 500 metres,NaN
9,Christine Jacoba Aaftink,F,NED,1994,Winter,Speed Skating,"Speed Skating Women's 1,000 metres",NaN

In [76]:
print(primary_data.head(),regions.head(),gdp.head(),happiness.head(),host.head(),athlete_data.head())

   Year    City     Sport Discipline             Athlete Country Gender  \
0  1896  Athens  Aquatics   Swimming       HAJOS, Alfred     HUN    Men
1  1896  Athens  Aquatics   Swimming    HERSCHMANN, Otto     AUT    Men
2  1896  Athens  Aquatics   Swimming   DRIVAS, Dimitrios     GRE    Men
3  1896  Athens  Aquatics   Swimming  MALOKINIS, Ioannis     GRE    Men
4  1896  Athens  Aquatics   Swimming  CHASAPIS, Spiridon     GRE    Men

                        Event   Medal
0              100M Freestyle    Gold
1              100M Freestyle  Silver
2  100M Freestyle For Sailors  Bronze
3  100M Freestyle For Sailors    Gold
4  100M Freestyle For Sailors  Silver      NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN        Country Code  Year  GDP-Growth  GDP-Per-Capita  GDP
0        Aruba  ABW  1960         NaN             NaN  NaN
1  Afghanistan  AFG  1960         NaN             NaN  NaN
2       Angola  AGO  1960         NaN             NaN  NaN
3      Albania  ALB  1960         NaN             NaN  NaN
4      Andorra  AND  1960         NaN             NaN  NaN        Country  Happiness.Rank  Happiness.Score  Whisker.high  Whisker.low  \
0       Norway               1            7.537      7.594445     7.479556
1      Denmark               2            7.522      7.581728     7.462272
2      Iceland               3            7.504      7.622030     7.385970
3  Switzerland               4            7.494      7.561772     7.426227
4      Finland               5            7.469      7.527542     7.410458

   Economy..GDP.per.Capita.    Family  Health..Life.Expectancy.   Freedom  \
0                  1.616463  1.533524                  0.796667  0.635423
1                  1.482383  1.551122                  0.792566  0.626007
2                  1.480633  1.610574                  0.833552  0.627163
3                  1.564980  1.516912                  0.858131  0.620071
4                  1.443572  1.540247                  0.809158  0.617951

   Generosity  Trust..Government.Corruption.  Dystopia.Residual
0    0.362012                       0.315964           2.277027
1    0.355280                       0.400770           2.313707
2    0.475540                       0.153527           2.322715
3    0.290549                       0.367007           2.276716
4    0.245483                       0.382612           2.430182           City         Country  NOC Summer Winter  Year   Latitude  Longitude
0     Athens          Greece  GRE      I    NaN  1896  37.983333  23.733334
1      Paris          France  FRA     II    NaN  1900  48.853410   2.348800
2  St. Louis   United States  USA    III    NaN  1904  38.627273 -90.197891
3     London  United Kingdom  GBR     IV    NaN  1908  51.508415  -0.125533
4  Stockholm          Sweden  SWE      V    NaN  1912  59.332577  18.064903                        Name Sex  NOC  Year  Season          Sport  \
0                 A Dijiang   M  CHN  1992  Summer     Basketball
1                  A Lamusi   M  CHN  2012  Summer           Judo
2       Gunnar Nielsen Aaby   M  DEN  1920  Summer       Football
3      Edgar Lindenau Aabye   M  DEN  1900  Summer     Tug-Of-War
4  Christine Jacoba Aaftink   F  NED  1988  Winter  Speed Skating

                              Event Medal
0       Basketball Men's Basketball   NaN
1      Judo Men's Extra-Lightweight   NaN
2           Football Men's Football   NaN
3       Tug-Of-War Men's Tug-Of-War  Gold
4  Speed Skating Women's 500 metres   NaN

In [77]:
primary_data.head(5)

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [78]:
primary_data.describe(include = 'all')

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
count,31165.000000,31165,31165,31165,31165,31161,31165,31165,31165
unique,NaN,22,43,67,22762,147,2,666,3
top,NaN,London,Aquatics,Athletics,"PHELPS, Michael",USA,Men,Football,Gold
freq,NaN,3567,4170,3638,22,4585,22746,1497,10486
mean,1970.482785,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,33.158416,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,1896.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,1948.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,1980.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,2000.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,2012.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [79]:
primary_data.Year.unique()

array([1896, 1900, 1904, 1908, 1912, 1920, 1924, 1928, 1932, 1936, 1948,
       1952, 1956, 1960, 1964, 1968, 1972, 1976, 1980, 1984, 1988, 1992,
       1996, 2000, 2004, 2008, 2012], dtype=int64)

In [19]:
primary_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [80]:
#Defining a disctionary whey Key = Column name, Value = data type in which it needs to be converted
dtype_dict = {"City":"category","Sport":"category","Discipline":"category","Athlete":"category","Discipline":"category","Country":"category","Gender":"category","Event":"category","Medal":"category"}

# Converting data types 
primary_data = primary_data.astype(dtype_dict)
primary_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  category
 2   Sport       31165 non-null  category
 3   Discipline  31165 non-null  category
 4   Athlete     31165 non-null  category
 5   Country     31161 non-null  category
 6   Gender      31165 non-null  category
 7   Event       31165 non-null  category
 8   Medal       31165 non-null  category
dtypes: category(8), int64(1)
memory usage: 1.4 MB

In [81]:
primary_data.isnull().sum()

Year          0
City          0
Sport         0
Discipline    0
Athlete       0
Country       4
Gender        0
Event         0
Medal         0
dtype: int64

In [82]:
primary_data[pd.isnull(primary_data.Country)]

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
29603,2012,London,Athletics,Athletics,Pending,NaN,Women,1500M,Gold
31072,2012,London,Weightlifting,Weightlifting,Pending,NaN,Women,63KG,Gold
31091,2012,London,Weightlifting,Weightlifting,Pending,NaN,Men,94KG,Silver
31110,2012,London,Wrestling,Wrestling Freestyle,"KUDUKHOV, Besik",NaN,Men,Wf 60 KG,Silver

In [83]:
# Dropping the null values
primary_data.dropna(inplace =  True)
primary_data.shape

(31161, 9)

In [26]:
host.head()

        City         Country  NOC Summer Winter  Year   Latitude  Longitude
0     Athens          Greece  GRE      I    NaN  1896  37.983333  23.733334
1      Paris          France  FRA     II    NaN  1900  48.853410   2.348800
2  St. Louis   United States  USA    III    NaN  1904  38.627273 -90.197891
3     London  United Kingdom  GBR     IV    NaN  1908  51.508415  -0.125533
4  Stockholm          Sweden  SWE      V    NaN  1912  59.332577  18.064903

In [84]:
regions.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [85]:
region_temp = regions.copy()
region_temp.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [86]:
#Dropping unnecessary data 
region_temp.drop(columns = 'notes', inplace=True)
region_temp.head()

   NOC       region
0  AFG  Afghanistan
1  AHO      Curacao
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

In [87]:
modified_primary_data = primary_data.copy()
modified_primary_data.rename(columns = {"Country":"NOC"}, inplace = True)

#Modifying primary data 
modified_primary_data = pd.merge(left = modified_primary_data, right=region_temp, on ="NOC", how="left")

modified_primary_data.head()

modified_primary_data.rename(columns = {'region':'Winning Country'}, inplace=True)
modified_primary_data.head()

,Year,City,Sport,Discipline,Athlete,NOC,Gender,Event,Medal,Winning Country
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Hungary
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Austria
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Greece
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Greece
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Greece

In [88]:
# Making changes to permanant to primary data 
primary_data = modified_primary_data
primary_data.shape

(31161, 10)

In [89]:
# Loading dataframe in temporary variable 
winners = primary_data.copy()


#Male winners 
male_winners = winners[winners.Gender == 'Men']
winner_male = male_winners.Year.value_counts().sort_index()
winner_male = pd.DataFrame(winner_male)

#Female winners 
female_winners = winners[winners.Gender == 'Women']
winner_female = female_winners.Year.value_counts().sort_index()
winner_female = pd.DataFrame(winner_female)

#Resetting Indices
winner_male.reset_index(level=0, inplace = True)
winner_female.reset_index(level=0, inplace = True)


#Renaming column headings for merging purpose
winner_male.rename(columns = {"index":"Year", "Year":"Male Winners"}, inplace=True)
winner_female.rename(columns = {"index":"Year", "Year":"Female Winners"}, inplace=True)


#Merging both data
all_winners_stats = pd.merge(left = winner_male, right = winner_female, how= "left", on="Year")
all_winners_stats.set_index("Year", inplace=True)
all_winners_stats.head()

      Male Winners  Female Winners
Year
1896           151             NaN
1900           501            11.0
1904           458            12.0
1908           789            15.0
1912           855            30.0